import { PAGE_TITLE } from '@/constants/index.ts';
import { useTitle } from '@/hooks/useTitle.tsx';
import { useEffect } from 'react';
import HistoryIcon from '@mui/icons-material/History';

interface Props {
    // Define your component props here
}

const AboutUserPage: React.FC<Props> = () => {
    const { setTitle } = useTitle();

    useEffect(() => {
        setTitle(PAGE_TITLE.about);
    }, [setTitle]);

    return (
        <div>
            <h2>Реєстрація</h2>
            <p>
                Під час реєстрації ваші дані поміщаються до бази даних, бот
                зберігає обмежену кількість інформації про вас:
            </p>
            <ul>
                <li>Ім'я та Прізвище (які ви вказали під час реєстрації)</li>
                <li>
                    first_name, username, id (ваши дані з телеграму) щоб можна
                    було вас знайти в телеграмі
                </li>
            </ul>
            <h2>Загальна інформація</h2>
            <p>
                Бот також відповідальний за потрапляння у телеграм групу, якщо
                ваш акаунт було підтверджено адміністратором, ви отримаєте
                доступ до групи за допомогою запрошувального посилання. Бот може
                автоматично обмежити використання ним та видалить вас з групи,
                якщо ви не відвідуєте заняття протягом 90 днів або ж ви
                самостійно покинули телеграм групу. <br />
                Особисті повідомлення боту, які не є командами або ж взаємодією
                через динамічну меню, ігноруються ботом. У телеграм групі усі
                повідомлення ігноруються ботом. <br />
                Бот також зберігає історію відвідувань занять та історію змін у
                вашому абонементі з метою вирішення можливих проблем з
                невідповідністю даних.
                <br />
                Переглянути свою історію можна, натиснувши у верхньому меню{' '}
                <HistoryIcon />
            </p>

            <h2>Абонемент</h2>
            <p>
                На момент написання цього документу, абонемент має наступні
                властивості:
            </p>
            <ul>
                <li>Стандартну кількість занять (8)</li>
                <li>Тривалість абонементу 40 днів</li>
                <li>
                    Абонемент можна призупинити на 10 днів, один раз на 90 днів.
                    Використовуйте цю функцію, якщо не можете відвідати заняття,
                    але хочете зберегти можливість відвідувати їх у майбутньому.
                    У будь-який момент ви можете відновити його вручну, або ж
                    він автоматично відновиться після 10 днів з моменту його
                    зупинки.
                </li>
                <li>
                    QR-код - це один із способів, як викладач може відмітити
                    вашу присутність на занятті.
                </li>
            </ul>
            <p>
                Абонемент створюється автоматично при реєстрації, але його
                активація відбувається вручну викладачем після оплати. Бот
                автоматично оновлює дані про кількість занять та дату закінчення
                абонементу після кожного заняття. Якщо заняття закінчилися або ж
                вийшов термін дії абонементу, бот має можливість повідомити вас
                про це (тільки якщо у вас увімкнені сповіщення).
            </p>

            <p>
                Якщо вам здається, що ваш абонемент не відображає вірну
                інформацію, будь ласка, зверніться до викладача. Також можете
                повідомляти про неочікувану поведінку бота або ж пропозиції щодо
                його роботи.
            </p>
        </div>
    );
};

export default AboutUserPage;
