import { PAGE_TITLE } from '@/constants/index.ts';
import { useTitle } from '@/hooks/useTitle.tsx';
import { useEffect } from 'react';

const AboutPage = () => {
    const { setTitle } = useTitle();

    useEffect(() => {
        setTitle(PAGE_TITLE.about);
    }, [setTitle]);

    return (
        <div className="about">
            <div className="article">
                <p>
                    Наш телеграм бот забезпечує керування користувачами та їх
                    абонементами. Він надає адміністратору змогу редагувати
                    дані, а користувачам - зручні інструменти взаємодії.
                </p>

                <h2>Ролі Користувачів</h2>
                <ul>
                    <li>
                        <b>user</b>: Користувач може приєднатися до групи,
                        керувати абонементом, отримувати інформацію про платежі
                        та сповіщення.
                    </li>
                    <li>
                        <b>admin</b>: Адміністратор має повний доступ до
                        управління користувачами та абонементами, зокрема,
                        активація/деактивація абонементу, апрув користувачів,
                        редагування інформації, тощо.
                    </li>
                    <li>
                        <b>guest</b>: Нові користувачі, які очікують
                        підтвердження адміністратором.
                    </li>
                    <li>
                        <b>developer</b>: Роль для розробників, що дозволяє
                        тестувати будь-яку частину бота.
                    </li>
					<li>
						<b>inactive</b>: Роль яка обмежує доступ до використання бота.
					</li>
                </ul>

                <h2>Взаємодія з Ботом</h2>
                <p>
                    Користувачі можуть взаємодіяти з ботом через команди,
                    динамічне меню та веб-інтерфейс.
                </p>

                <h2>Апрув Користувачів</h2>
                <p>
                    Адміністратор отримує запити на реєстрацію від нових
                    користувачів. Після підтвердження адміном, користувачі
                    отримують доступ до групи та можуть взаємодіяти з ботом.
                </p>

                <h2>Управління Абонементами</h2>
                <p>
                    Абонементи активуються адміністратором та мають стандартні
                    параметри. Бот повідомляє користувачів про важливі події,
                    такі як закінчення терміну абонементу.
                </p>

                <h2>Блокування Користувачів</h2>
                <p>
                    Бот автоматично блокує користувачів, які порушують правила
                    використання. Адмін може розблокувати користувача вручну.
                </p>

                <h2>Автоматична Перевірка</h2>
                <p>
                    Бот автоматично перевіряє терміни дії абонементів та
                    надсилає сповіщення про закінчення абонементу.
                </p>

                <h2>Команди</h2>
                <ul>
                    <li>
                        <b>/ban</b>: Заблокувати користувача.
                    </li>
                    <li>
                        <b>/unban</b>: Розблокувати користувача.
                    </li>
                    <li>
                        <b>/allBaned</b>: Показати список всіх заблокованих
                        користувачів.
                    </li>
                    <li>
                        <b>/clearBlacklist</b>: Очистити список заблокованих
                        користувачів.
                    </li>
                    <li>
                        <b>/crypto</b>: Вмикає режим криптографії.
                    </li>
                    <li>
                        <b>/start</b>: Почати взаємодію з ботом.
                    </li>
                    <li>
                        <b>/changename</b>: Змінити ім'я користувача.
                    </li>
                    <li>
                        <b>/about</b>: Отримати загальну інформацію про бота.
                    </li>
                </ul>
            </div>
        </div>
    );
};

export default AboutPage;
